Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT700/fsl_power.c
/*
 * Copyright 2023-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_common.h"
#include "fsl_power.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.power"
#endif
#define MEGA (1000000U)

#if defined(PMC0)
#define PMC      PMC0
#define SLEEPCON SLEEPCON0
#elif defined(PMC1)
#define PMC      PMC1
#define SLEEPCON SLEEPCON1
#else
#error "Unsupported header file"
#endif

#define PMC_PDRCFG_REG(x)         (*((volatile uint32_t *)((uint32_t)(&(PMC->PDRUNCFG0)) + ((x - 1U) << 2U))))
#define SLEEPCON_PDRCFGSET_REG(x) (*((volatile uint32_t *)((uint32_t)(&(SLEEPCON->RUNCFG_SET)) + ((x) << 2U))))
#define SLEEPCON_PDRCFGCLR_REG(x) (*((volatile uint32_t *)((uint32_t)(&(SLEEPCON->RUNCFG_CLR)) + ((x) << 2U))))

#define PMC_REG(off) (*((volatile uint32_t *)(void *)PMC + (off) / 4U))

#define LP_CTRL_REG(offset)        (*((volatile uint32_t *)((uint32_t)(&(SLEEPCON->SHA_MED_CCTRL0)) + ((offset) << 2U))))
#define LP_STATE_REG(offset)       (*((volatile uint32_t *)((uint32_t)(&(SLEEPCON->SHA_MED_CSTAT0)) + ((offset) << 2U))))
#define POWER_LP_REQ_TIMEOUT_COUNT (400U)

/* Get AFBB bits mask from RBB bits mask for _body_bias_domain */
/* #define POWER_AFBB_BITS_MASK(x) (((x)&0x20000000u) << 2U | (((x)&0x05400000u) << 1U)) */
#define POWER_AFBB_BITS_MASK(x) (((x)&0x05400000u) << 1U)

/* Each loop has 4 instructions.*/
#define US2LOOP(clk, x) ((clk / MEGA * x) >> 2U)

/* Calcuate the voltage in uV for given LVD register value. */
#define POWER_CALCULATE_LVD_VOLT_FROM_VALUE(x) (500000U + 10000U * (x))

#if defined(PMC0)
/* SLEEPCON SLEEPCFG0 */
#define SCFG0_DEEP_SLEEP                                                                                             \
    (SLEEPCON0_SLEEPCFG_COMP_MAINCLK_SHUTOFF_MASK | SLEEPCON0_SLEEPCFG_SENSEP_MAINCLK_SHUTOFF_MASK |                 \
     SLEEPCON0_SLEEPCFG_SENSES_MAINCLK_SHUTOFF_MASK | SLEEPCON0_SLEEPCFG_RAM0_CLK_SHUTOFF_MASK |                     \
     SLEEPCON0_SLEEPCFG_RAM1_CLK_SHUTOFF_MASK | SLEEPCON0_SLEEPCFG_COMN_MAINCLK_SHUTOFF_MASK |                       \
     SLEEPCON0_SLEEPCFG_MEDIA_MAINCLK_SHUTOFF_MASK | SLEEPCON0_SLEEPCFG_XTAL_PD_MASK |                               \
     SLEEPCON0_SLEEPCFG_FRO0_PD_MASK | SLEEPCON0_SLEEPCFG_FRO1_PD_MASK | SLEEPCON0_SLEEPCFG_FRO2_PD_MASK |           \
     SLEEPCON0_SLEEPCFG_LPOSC_PD_MASK | SLEEPCON0_SLEEPCFG_PLLANA_PD_MASK | SLEEPCON0_SLEEPCFG_PLLLDO_PD_MASK |      \
     SLEEPCON0_SLEEPCFG_AUDPLLANA_PD_MASK | SLEEPCON0_SLEEPCFG_AUDPLLLDO_PD_MASK | SLEEPCON0_SLEEPCFG_ADC0_PD_MASK | \
     SLEEPCON0_SLEEPCFG_FRO0_GATE_MASK | SLEEPCON0_SLEEPCFG_FRO2_GATE_MASK)

#define POWER_IS_XIP_XSPI0()                                                                  \
    ((((uint32_t)POWER_ApplyPD >= 0x28000000U) && ((uint32_t)POWER_ApplyPD < 0x30000000U)) || \
     (((uint32_t)POWER_ApplyPD >= 0x38000000U) && ((uint32_t)POWER_ApplyPD < 0x40000000U)))
#define POWER_IS_XIP_XSPI1()                                                                  \
    ((((uint32_t)POWER_ApplyPD >= 0x08000000U) && ((uint32_t)POWER_ApplyPD < 0x10000000U)) || \
     (((uint32_t)POWER_ApplyPD >= 0x18000000U) && ((uint32_t)POWER_ApplyPD < 0x20000000U)))

/* Mask used for low power request - ack handshake for modules with DMA HWWake function. */
#define PRIVATE_TCTRL_HWWAKE_MODULE_MASK0 (0x3FFFU) /* LP_FLEXCOMM0-13 Bus Low power request. */
#define PRIVATE_TSTAT_HWWAKE_MODULE_MASK0 (0x3FFFU)
#define PRIVATE_TCTRL_HWWAKE_MODULE_MASK1                                                  \
    (SLEEPCON0_PRIVATE_TCTRL2_SAI0_LPREQ_MASK | SLEEPCON0_PRIVATE_TCTRL2_SAI1_LPREQ_MASK | \
     SLEEPCON0_PRIVATE_TCTRL2_SAI2_LPREQ_MASK) /* SAI0-2 */
#define PRIVATE_TSTAT_HWWAKE_MODULE_MASK1                                                        \
    (SLEEPCON0_PRIVATE_TSTAT1_SAI0_LPACCEPT_MASK | SLEEPCON0_PRIVATE_TSTAT1_SAI1_LPACCEPT_MASK | \
     SLEEPCON0_PRIVATE_TSTAT1_SAI2_LPACCEPT_MASK)
#define PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK \
    (SLEEPCON0_PRIVATE_CCTRL0_EDMA0_STOP_MASK | SLEEPCON0_PRIVATE_CCTRL0_EDMA1_STOP_MASK) /* DMA1, DMA0 */
#define SHA_MEDSEN_TSTAT_HWWAKE_MODULE_MASK                                                                 \
    (SLEEPCON0_SHA_MEDSEN_TSTAT0_FLEXIO_B_LPACCEPT_MASK | SLEEPCON0_SHA_MEDSEN_TSTAT0_MICFIL_STOPPED_MASK | \
     SLEEPCON0_SHA_MEDSEN_TSTAT0_LPSPI14_B_LPACCEPT_MASK | SLEEPCON0_SHA_MEDSEN_TSTAT0_LPSPI16_B_LPACCEPT_MASK)
#else

#define SCFG0_DEEP_SLEEP                                                                                            \
    (SLEEPCON1_SLEEPCFG_SENSEP_MAINCLK_SHUTOFF_MASK | SLEEPCON1_SLEEPCFG_SENSES_MAINCLK_SHUTOFF_MASK |              \
     SLEEPCON1_SLEEPCFG_RAM0_CLK_SHUTOFF_MASK | SLEEPCON1_SLEEPCFG_RAM1_CLK_SHUTOFF_MASK |                          \
     SLEEPCON1_SLEEPCFG_COMN_MAINCLK_SHUTOFF_MASK | SLEEPCON1_SLEEPCFG_MEDIA_MAINCLK_SHUTOFF_MASK |                 \
     SLEEPCON1_SLEEPCFG_XTAL_PD_MASK | SLEEPCON1_SLEEPCFG_FRO2_PD_MASK | SLEEPCON1_SLEEPCFG_LPOSC_PD_MASK |         \
     SLEEPCON1_SLEEPCFG_PLLANA_PD_MASK | SLEEPCON1_SLEEPCFG_PLLLDO_PD_MASK | SLEEPCON1_SLEEPCFG_AUDPLLANA_PD_MASK | \
     SLEEPCON1_SLEEPCFG_AUDPLLLDO_PD_MASK | SLEEPCON1_SLEEPCFG_ADC0_PD_MASK | SLEEPCON1_SLEEPCFG_FRO2_GATE_MASK)

/* Mask used for low power request - ack handshake for modules with DMA HWWake function. */
#define PRIVATE_TCTRL_HWWAKE_MODULE_MASK0                                                                          \
    (SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17__B_LPREQ_MASK | SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18__B_LPREQ_MASK | \
     SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19__B_LPREQ_MASK | SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20__B_LPREQ_MASK | \
     SLEEPCON1_PRIVATE_TCTRL0_SAI3_LPREQ_MASK)
#define PRIVATE_TSTAT_HWWAKE_MODULE_MASK0                                                                              \
    (SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_B_LPACCEPT_MASK | SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_B_LPACCEPT_MASK | \
     SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_B_LPACCEPT_MASK | SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_B_LPACCEPT_MASK | \
     SLEEPCON1_PRIVATE_TSTAT0_SAI3_LPACCEPT_MASK)
#define PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK \
    (SLEEPCON1_PRIVATE_CCTRL0_EDMA3_STOP_MASK | SLEEPCON1_PRIVATE_CCTRL0_EDMA2_STOP_MASK) /* DMA3, DMA2 */
#define SHA_MEDSEN_TSTAT_HWWAKE_MODULE_MASK \
    (SLEEPCON1_SHA_MEDSEN_TSTAT0_FLEXIO_B_LPACCEPT_MASK | SLEEPCON1_SHA_MEDSEN_TSTAT0_MICFIL_STOP_MASK)
#endif
/* PMC PDSLEEPCFG0. Note, when V2COM_DSR other VDD2 and VDDN switches should be off.   */
#define PCFG0_DEEP_SLEEP                                                                                \
    (PMC_PDSLEEPCFG0_V2DSP_PD_MASK | PMC_PDSLEEPCFG0_V2MIPI_PD_MASK | PMC_PDSLEEPCFG0_V2NMED_DSR_MASK | \
     PMC_PDSLEEPCFG0_VNCOM_DSR_MASK)
#define PCFG0_DSR                                                                                         \
    (PMC_PDSLEEPCFG0_V2COMP_DSR_MASK | PMC_PDSLEEPCFG0_V2NMED_DSR_MASK | PMC_PDSLEEPCFG0_V2COM_DSR_MASK | \
     PMC_PDSLEEPCFG0_VNCOM_DSR_MASK)
#define PCFG1_DEEP_SLEEP                                                                              \
    (PMC_PDSLEEPCFG1_TEMP_PD_MASK | PMC_PDSLEEPCFG1_PMCREF_LP_MASK | PMC_PDSLEEPCFG1_HVD1V8_PD_MASK | \
     PMC_PDSLEEPCFG1_POR1_LP_MASK | PMC_PDSLEEPCFG1_LVD1_LP_MASK | PMC_PDSLEEPCFG1_HVD1_PD_MASK |     \
     PMC_PDSLEEPCFG1_AGDET1_PD_MASK | PMC_PDSLEEPCFG1_POR2_LP_MASK | PMC_PDSLEEPCFG1_LVD2_LP_MASK |   \
     PMC_PDSLEEPCFG1_HVD2_PD_MASK | PMC_PDSLEEPCFG1_AGDET2_PD_MASK | PMC_PDSLEEPCFG1_PORN_LP_MASK |   \
     PMC_PDSLEEPCFG1_LVDN_LP_MASK | PMC_PDSLEEPCFG1_HVDN_PD_MASK | PMC_PDSLEEPCFG1_OTP_PD_MASK |      \
     PMC_PDSLEEPCFG1_ROM_PD_MASK | PMC_PDSLEEPCFG1_SRAMSLEEP_MASK)
#define PCFG2_DEEP_SLEEP (0xFFFFFFFFU)
#define PCFG3_DEEP_SLEEP (0xFFFFFFFFU)
#define PCFG4_DEEP_SLEEP (0xFFFFFFFFU)
#define PCFG5_DEEP_SLEEP (0xFFFFFFFFU)

#define POWER_FREQ_LEVELS_NUM (5U)

#define POWER_INVALID_VOLT_LEVEL (0xFFFFFFFFU) /*! Invalid voltage level. */
#define POWER_MINI_ACTIVE_VOLT   (700000U)     /* Minimum VDD1/VDD2 volt for active mode. */
#define POWER_MAX_ACTIVE_VOLT    (1100000U)    /* Maximum VDD1/VDD2 volt for active mode. */
#define POWER_MINI_LVD_VOLT      (500000U)     /* Minimum LVDVDD1/LVDVDD2/LVDDCDC volt. */
#define POWER_MINI_LDO_VOLT      (450000U)     /* Minimum LDO output volt. */
#define POWER_MINI_DCDC_VOLT     (500000U)     /* Minimum DCDC output volt. */
#define POWER_LVD_VOLT_SLOPE     (10000U)      /* LVDVDD1/LVDVDD2/LVDDCDC volt slope. */
#define POWER_LDO_VOLT_SLOPE     (12500U)      /* LDO volt slope. */
#define POWER_DCDC_VOLT_SLOPE    (6250U)       /* DCDC output volt slope. */
/*******************************************************************************
 * Variables
 ******************************************************************************/
#if defined(PMC0)                               /* Only PMC0 can power down DCDC, LDO. */
static power_vdd_src_t s_vddnSrc = kVddSrc_PMC; /* VDDN supply source, DCDC or PMIC. */
static power_vdd_src_t s_vdd1Src = kVddSrc_PMC;
static power_vdd_src_t s_vdd2Src = kVddSrc_PMC;

AT_QUICKACCESS_SECTION_DATA(static uint32_t lpReqConfig[5]);
AT_QUICKACCESS_SECTION_DATA(static bool xspiCacheEnabled);
#else
AT_QUICKACCESS_SECTION_DATA(static uint32_t lpReqConfig[4]);
#endif /* PMC0 */

