Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT700/fsl_power.c
static const uint32_t powerFreqLevel[2U][POWER_FREQ_LEVELS_NUM] = {
    {325U * MEGA, 250U * MEGA, 192U * MEGA, 110U * MEGA, 45U * MEGA},
    {250U * MEGA, 205U * MEGA, 160U * MEGA, 100U * MEGA, 45U * MEGA}};
static const uint32_t powerLdoVoltLevel[POWER_FREQ_LEVELS_NUM] = {1100000U, 1000000U, 900000U, 800000U, 700000U};
/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief API to enable PDRUNCFG bit in the SLEEPCON and PMC. Note that enabling the bit powers down the peripheral
 *
 * @param en    peripheral for which to enable the PDRUNCFG bit
 * @return none
 */
void POWER_EnablePD(pd_bit_t en)
{
    assert(en != kPDRUNCFG_ForceUnsigned);

    if (GET_PD_REG_FROM_BITS(en) != 0U) /* PMC PDRUNCFG */
    {
        PMC_PDRCFG_REG(GET_PD_REG_FROM_BITS(en)) |= (1UL << (((uint32_t)en) & 0xFFU));
    }
    else /* SLEEPCON_RUNCFG */
    {
        SLEEPCON_PDRCFGSET_REG(GET_PD_REG_FROM_BITS(en)) = (1UL << (((uint32_t)en) & 0xFFU));
    }
}

/*!
 * @brief API to disable PDRUNCFG bit in the Sysctl0. Note that disabling the bit powers up the peripheral
 *
 * @param en    peripheral for which to disable the PDRUNCFG bit
 * @return none
 */
void POWER_DisablePD(pd_bit_t en)
{
    assert(en != kPDRUNCFG_ForceUnsigned);

    if (GET_PD_REG_FROM_BITS(en) != 0U) /* PMC PDRUNCFG */
    {
        PMC_PDRCFG_REG(GET_PD_REG_FROM_BITS(en)) &= ~(1UL << (((uint32_t)en) & 0xFFU));
    }
    else /* SLEEPCON_RUNCFG */
    {
        SLEEPCON_PDRCFGCLR_REG(GET_PD_REG_FROM_BITS(en)) = (1UL << (((uint32_t)en) & 0xFFU));
    }
}

/* Low power request and wait ACK. */
status_t POWER_ModuleEnterLPRequest(lp_bit_t en)
{
    uint32_t timeout = POWER_LP_REQ_TIMEOUT_COUNT;
    /* Assert low power request. */
    LP_CTRL_REG(GET_LP_CTRL_REG_FROM_BITS(en)) |= 1UL << (GET_LP_CTRL_BIT_FROM_BITS(en));

    /* Wait ACK. */
    while ((LP_STATE_REG(GET_LP_STATE_REG_FROM_BITS(en)) & (1UL << (GET_LP_STATE_BIT_FROM_BITS(en)))) == 0U)
    {
        timeout--;

        if (timeout == 0U)
        {
            return kStatus_Timeout;
        }
    }

    return kStatus_Success;
}

void POWER_ModuleExitLPRequest(lp_bit_t en)
{
    /* Clear low power request. */
    LP_CTRL_REG(GET_LP_CTRL_REG_FROM_BITS(en)) &= ~(1UL << (GET_LP_CTRL_BIT_FROM_BITS(en)));
}

/**
 * @brief  API to apply updated PMC PDRUNCFG bits in the Sysctl0.
 */
void POWER_ApplyPD(void)
{
    /* Cannot set APPLYCFG when BUSY is 1 */
    while ((PMC->STATUS & PMC_STATUS_BUSY_MASK) != 0U)
    {
    }
    PMC->CTRL |= PMC_CTRL_APPLYCFG_MASK;
    /* Wait all PMC finite state machines finished. */
    while ((PMC->STATUS & PMC_STATUS_BUSY_MASK) != 0U)
    {
    }
}

void POWER_SetPmicMode(uint32_t mode, pmic_mode_reg_t reg)
{
    __disable_irq();

    PMC_REG((uint32_t)reg) =
        (PMC_REG((uint32_t)reg) & ~PMC_PDSLEEPCFG0_PMICMODE_MASK) | (mode << PMC_PDSLEEPCFG0_PMICMODE_SHIFT);

    __enable_irq();
}

uint32_t POWER_GetPmicMode(pmic_mode_reg_t reg)
{
    uint32_t mode = (uint32_t)reg;

    return ((PMC_REG(mode) & PMC_PDSLEEPCFG0_PMICMODE_MASK) >> PMC_PDSLEEPCFG0_PMICMODE_SHIFT);
}

/**
 * @brief   Clears the PMC event flags state.
 * @param   statusMask : A bitmask of event flags that are to be cleared.
 */
void POWER_ClearEventFlags(uint32_t statusMask)
{
    PMC->FLAGS = statusMask;
}

/**
 * @brief   Get the PMC event flags state.
 * @return  PMC FLAGS register value
 */
uint32_t POWER_GetEventFlags(void)
{
    return PMC->FLAGS;
}

/**
 * @brief   Enable the PMC reset requests.
 * @param   resetMask : A bitmask of of resets to enable.
 */
void POWER_EnableResets(uint32_t resetMask)
{
    PMC->CTRL |= resetMask;
}

/**
 * @brief   Disable the PMC reset requests.
 * @param   resetMask : A bitmask of of resets to disable.
 */
void POWER_DisableResets(uint32_t resetMask)
{
    PMC->CTRL &= ~resetMask;
}

/**
 * @brief   Enable the PMC interrupt requests.
 * @param   interruptMask : A bitmask of of interrupts to enable.
 */
void POWER_EnableInterrupts(uint32_t interruptMask)
{
    PMC->INTRCTRL |= interruptMask;
}

void POWER_EnableDMAHWWake(uint32_t sources)
{
    SLEEPCON->HW_WAKE_SET = sources;
}

void POWER_DisableDMAHWWake(uint32_t sources)
{
    SLEEPCON->HW_WAKE_CLR = sources;
}

/**
 * @brief   Disable the PMC interrupt requests.
 * @param   interruptMask : A bitmask of of interrupts to disable.
 */
void POWER_DisableInterrupts(uint32_t interruptMask)
{
    PMC->INTRCTRL &= ~interruptMask;
}

void EnableDeepSleepIRQ(IRQn_Type interrupt)
{
    assert(interrupt < (IRQn_Type)(NUMBER_OF_INT_VECTORS - 16U));

    uint32_t intNumber = (uint32_t)interrupt;

#if defined(PMC0)
    if (intNumber >= 128U)
    {
        /* enable interrupt wake up in the WAKEUPEN4 register */
        SLEEPCON->WAKEUPEN4_SET = 1UL << (intNumber - 128U);
    }
    else if (intNumber >= 96U)
    {
        SLEEPCON->WAKEUPEN3_SET = 1UL << (intNumber - 96U);
    }
    else if (intNumber >= 64U)
#else  /* For sense domain */
    if (intNumber >= 64U)
#endif /* PMC0 */
    {
        SLEEPCON->WAKEUPEN2_SET = 1UL << (intNumber - 64U);
    }
    else if (intNumber >= 32U)
    {
        SLEEPCON->WAKEUPEN1_SET = 1UL << (intNumber - 32U);
    }
    else
    {
        SLEEPCON->WAKEUPEN0_SET = 1UL << intNumber;
    }
    /* also enable interrupt at NVIC */
    (void)EnableIRQ(interrupt);
}

void DisableDeepSleepIRQ(IRQn_Type interrupt)
{
    assert(interrupt < (IRQn_Type)(NUMBER_OF_INT_VECTORS - 16U));

    uint32_t intNumber = (uint32_t)interrupt;

    /* also disable interrupt at NVIC */
    (void)DisableIRQ(interrupt);

#if defined(PMC0)
    if (intNumber >= 128U)
    {
        /* enable interrupt wake up in the WAKEUPEN4 register */
        SLEEPCON->WAKEUPEN4_CLR = 1UL << (intNumber - 128U);
    }
    else if (intNumber >= 96U)
    {
        SLEEPCON->WAKEUPEN3_CLR = 1UL << (intNumber - 96U);
    }
    else if (intNumber >= 64U)
#else
    if (intNumber >= 64U)
#endif /* PMC0 */
    {
        SLEEPCON->WAKEUPEN2_CLR = 1UL << (intNumber - 64U);
    }
    else if (intNumber >= 32U)
    {
        SLEEPCON->WAKEUPEN1_CLR = 1UL << (intNumber - 32U);
    }
    else
    {
        SLEEPCON->WAKEUPEN0_CLR = 1UL << intNumber;
    }
}

