Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT700/fsl_power.c
void POWER_EnableLPRequestMask(uint32_t mask)
{
    SLEEPCON->SHARED_MASK0_SET |= mask;
}

void POWER_DisableLPRequestMask(uint32_t mask)
{
    SLEEPCON->SHARED_MASK0_CLR |= mask;
}

void POWER_EnterSleep(void)
{
    uint32_t pmsk;
    pmsk = __get_PRIMASK();
    __disable_irq();
    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
    __WFI();
    __set_PRIMASK(pmsk);
}

void POWER_EnableAutoWake(uint16_t ticks)
{
    PMC->WAKEUP = (PMC->WAKEUP & 0x3F000000U) | PMC_WAKEUP_WAKETIME(ticks); /* Don't clear the [WKSRCF] W1C bits! */
    PMC->INTRCTRL |= PMC_INTRCTRL_AUTOWKIE_MASK;
    EnableDeepSleepIRQ(PMC_IRQn);
}

void POWER_EnableRunAFBB(uint32_t mask)
{
    /* clear AFBBxxx_PD, set RBBxxx_PD. No AFBBSRAM1, AFBBSRAM2 bit. */
    PMC->PDRUNCFG0 &= ~POWER_AFBB_BITS_MASK(mask);
    PMC->PDRUNCFG0 |= mask;
}

void POWER_EnableSleepAFBB(uint32_t mask)
{
    /* clear AFBBxxx_PD, set RBBxxx_PD. No AFBBSRAM1 bit. */
    PMC->PDSLEEPCFG0 &= ~POWER_AFBB_BITS_MASK(mask);
    PMC->PDSLEEPCFG0 |= mask;
}

void POWER_EnableRunRBB(uint32_t mask)
{
    PMC->PDRUNCFG0 &= ~mask; /* Clear RBB* bits, set AFBB* bits */
    PMC->PDRUNCFG0 |= POWER_AFBB_BITS_MASK(mask);
}

void POWER_EnableSleepRBB(uint32_t mask)
{
    /* Set AFBB bits, clear RBB bits. */
    PMC->PDSLEEPCFG0 &= ~mask;
    PMC->PDSLEEPCFG0 |= POWER_AFBB_BITS_MASK(mask);
}

void POWER_EnableRunNBB(uint32_t mask)
{
    /* Set AFBB and RBB bits. */
    PMC->PDRUNCFG0 |= mask | POWER_AFBB_BITS_MASK(mask);
}

void POWER_EnableSleepNBB(uint32_t mask)
{
    /* Set AFBB bits and RBB bits. */
    PMC->PDSLEEPCFG0 |= mask | POWER_AFBB_BITS_MASK(mask);
}

static uint32_t POWER_CalRegValueFromVolt(uint32_t volt, uint32_t base, uint32_t slope)
{
    uint32_t temp     = 0U;
    uint32_t regValue = 0U;

    if (volt <= base)
    {
        regValue = 0U;
    }
    else
    {
        temp = volt - base - 1U; /* Rounding up.*/
        assert(temp < (UINT32_MAX - slope));
        regValue = (uint32_t)((temp + slope) / slope);
    }

    return regValue;
}

uint32_t POWER_CalcVoltLevel(power_regulator_t regulator, uint32_t maxFreqHz, uint32_t miniVoltUV)
{
    uint32_t i;
    uint32_t index;
    uint32_t volt;

    assert(regulator != kRegulator_DCDC);

    miniVoltUV = miniVoltUV < POWER_MINI_ACTIVE_VOLT ? POWER_MINI_ACTIVE_VOLT : miniVoltUV;

    for (i = 0U; i < POWER_FREQ_LEVELS_NUM; i++)
    {
        if ((maxFreqHz > powerFreqLevel[(uint32_t)regulator - 1U][i]) ||
            ((POWER_MAX_ACTIVE_VOLT - 100000U * i) < miniVoltUV))
        {
            break;
        }
    }

    if (i == 0U) /* Frequency exceed max supported */
    {
        volt = POWER_INVALID_VOLT_LEVEL;
    }
    else
    {
        index = i - 1U; /* The index for powerLdoVoltLevel */
        volt  = powerLdoVoltLevel[index];
    }

    return volt;
}

static void POWER_SetRegulatorRegister(power_regulator_t regulator, uint32_t ldoVolt, uint32_t lvdVolt, uint32_t index)
{
    assert(index < 4U);

    uint32_t shift  = index * 8UL;
    uint32_t ldoReg = POWER_CalRegValueFromVolt(ldoVolt, POWER_MINI_LDO_VOLT, POWER_LDO_VOLT_SLOPE);
    uint32_t lvdReg = POWER_CalRegValueFromVolt(lvdVolt, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE);

    /* LDOVDDxVSEL */
    PMC_REG(0x20U + 4U * (uint32_t)regulator) &= ~(0xFFUL << shift);
    PMC_REG(0x20U + 4U * (uint32_t)regulator) |= (ldoReg & 0x3FU) << shift;

    /* LVDVDDxCTRL */
    PMC_REG(0x2CU + 4U * (uint32_t)regulator) &= ~(0xFFUL << shift);
    PMC_REG(0x2CU + 4U * (uint32_t)regulator) |= (lvdReg & 0x3FU) << shift;
}

status_t POWER_ConfigRegulatorSetpointsForFreq(
    power_regulator_t regulator, uint32_t *maxFreqHz, uint32_t *miniVoltUV, uint32_t startPoint, uint32_t num)
{
    uint32_t volt = 0U;
    uint32_t regValue, preVolt = 0U;
    uint32_t i, index, endPoint = startPoint + num;

    assert((num >= 1U) && ((num - startPoint) <= 4U));
    assert(regulator != kRegulator_DCDC);

    /* The value of VSEL should meet, VSEL3 >= VSEL2 >= VSEL1 >= VSEL0, check parameter. */
    if (startPoint != 0U)
    {
        regValue = (PMC_REG(0x20U + 4U * (uint32_t)regulator) >> ((startPoint - 1U) * 8UL)) & 0x3FUL;
        preVolt  = POWER_MINI_LDO_VOLT + regValue * 12500U;
    }

    for (i = startPoint; i < endPoint; i++)
    {
        index = i - startPoint;
        if (maxFreqHz[index] == 0U)
        {
            volt = miniVoltUV[index];
        }
        else
        {
            volt = POWER_CalcVoltLevel(regulator, maxFreqHz[index], miniVoltUV[index]);
        }
        if ((volt < preVolt) || (volt < POWER_MINI_LDO_VOLT) || (volt > 1150000U))
        {
            return kStatus_InvalidArgument;
        }

        /* For the internal LDOs, the voltage accuracy is not 100%. The target voltage should be configured adding some
         * margin in case the minimum voltage is still supplied to the chip. */
        volt    = volt + POWER_LDO_SAFE_MARGIN(volt);
        preVolt = volt;
        POWER_SetRegulatorRegister(regulator, volt, volt - POWER_DEFAULT_LVD_VOLT, i);
    }

    if (endPoint < 4U)
    {
        regValue = (PMC_REG(0x20U + 4U * (uint32_t)regulator) >> (endPoint * 8UL)) & 0x3FUL;
        preVolt  = POWER_MINI_LDO_VOLT + regValue * 12500U;
        if (volt > preVolt)
        {
            return kStatus_InvalidArgument;
        }
    }

    return kStatus_Success;
}

status_t POWER_ConfigRegulatorSetpoints(power_regulator_t regulator,
                                        const power_regulator_voltage_t *volt,
                                        const power_lvd_voltage_t *lvd)
{
    status_t ret = kStatus_Success;

#if defined(PMC0)
    if (regulator == kRegulator_DCDC) /* DCDC with 2 setpoints. */
    {
        if ((volt->DCDC.vsel1 < volt->DCDC.vsel0) || (lvd->VDDN.lvl1 < lvd->VDDN.lvl0) ||
            (volt->DCDC.vsel1 > 1150000U) || (volt->DCDC.vsel0 < 500000U))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC->DCDCVSEL = PMC_DCDCVSEL_VSEL0(POWER_CalRegValueFromVolt(volt->DCDC.vsel0, POWER_MINI_DCDC_VOLT,
                                                                         POWER_DCDC_VOLT_SLOPE)) |
                            PMC_DCDCVSEL_VSEL1(POWER_CalRegValueFromVolt(volt->DCDC.vsel1, POWER_MINI_DCDC_VOLT,
                                                                         POWER_DCDC_VOLT_SLOPE));
            PMC->LVDVDDNCTRL = PMC_LVDVDDNCTRL_LVL0(POWER_CalRegValueFromVolt(lvd->VDDN.lvl0, POWER_MINI_LVD_VOLT,
                                                                              POWER_LVD_VOLT_SLOPE)) |
                               PMC_LVDVDDNCTRL_LVL1(POWER_CalRegValueFromVolt(lvd->VDDN.lvl1, POWER_MINI_LVD_VOLT,
                                                                              POWER_LVD_VOLT_SLOPE));
        }
    }
#else
    if (regulator != kRegulator_Vdd1LDO) /* Only VDD1 LDO configurable from Sense side. */
    {
        ret = kStatus_InvalidArgument;
    }
#endif   /* PMC0, only compute domain support DCDC, LDO VDD2 control. */
    else /* LDO with 4 setpoints. */
    {
        if ((volt->LDO.vsel3 < volt->LDO.vsel2) || (volt->LDO.vsel2 < volt->LDO.vsel1) ||
            (volt->LDO.vsel1 < volt->LDO.vsel0) || (lvd->VDD12.lvl3 < lvd->VDD12.lvl2) ||
            (lvd->VDD12.lvl2 < lvd->VDD12.lvl1) || (lvd->VDD12.lvl1 < lvd->VDD12.lvl0) ||
            (volt->LDO.vsel3 > 1150000U) || (volt->LDO.vsel0 < 450000U))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC_REG(0x24U + 4U * ((uint32_t)regulator - 1U)) =
                PMC_LDOVDD1VSEL_VSEL0(
                    POWER_CalRegValueFromVolt(volt->LDO.vsel0, POWER_MINI_LDO_VOLT, POWER_LDO_VOLT_SLOPE)) |
                PMC_LDOVDD1VSEL_VSEL1(
                    POWER_CalRegValueFromVolt(volt->LDO.vsel1, POWER_MINI_LDO_VOLT, POWER_LDO_VOLT_SLOPE)) |
                PMC_LDOVDD1VSEL_VSEL2(
                    POWER_CalRegValueFromVolt(volt->LDO.vsel2, POWER_MINI_LDO_VOLT, POWER_LDO_VOLT_SLOPE)) |
                PMC_LDOVDD1VSEL_VSEL3(POWER_CalRegValueFromVolt(volt->LDO.vsel3, POWER_MINI_LDO_VOLT,
                                                                POWER_LDO_VOLT_SLOPE)); /* LDOVDDxVSEL */
            PMC_REG(0x30U + 4U * ((uint32_t)regulator - 1U)) =
                PMC_LVDVDD1CTRL_LVL0(
                    POWER_CalRegValueFromVolt(lvd->VDD12.lvl0, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE)) |
                PMC_LVDVDD1CTRL_LVL1(
                    POWER_CalRegValueFromVolt(lvd->VDD12.lvl1, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE)) |
                PMC_LVDVDD1CTRL_LVL2(
                    POWER_CalRegValueFromVolt(lvd->VDD12.lvl2, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE)) |
                PMC_LVDVDD1CTRL_LVL3(POWER_CalRegValueFromVolt(lvd->VDD12.lvl3, POWER_MINI_LVD_VOLT,
                                                               POWER_LVD_VOLT_SLOPE)); /* LVDVDDxCTRL */
        }
    }

    return ret;
}

status_t POWER_ConfigLvdSetpoints(power_regulator_t regulator, const power_lvd_voltage_t *lvd)
{
    status_t ret = kStatus_Success;

#if defined(PMC0)
    if (regulator == kRegulator_DCDC) /* DCDC with 2 setpoints. */
    {
        if ((lvd->VDDN.lvl1 < lvd->VDDN.lvl0) || (lvd->VDDN.lvl0 < POWER_MINI_LVD_VOLT))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC->LVDVDDNCTRL = PMC_LVDVDDNCTRL_LVL0(POWER_CalRegValueFromVolt(lvd->VDDN.lvl0, POWER_MINI_LVD_VOLT,
                                                                              POWER_LVD_VOLT_SLOPE)) |
                               PMC_LVDVDDNCTRL_LVL1(POWER_CalRegValueFromVolt(lvd->VDDN.lvl1, POWER_MINI_LVD_VOLT,
                                                                              POWER_LVD_VOLT_SLOPE));
        }
    }
#else
    if (regulator != kRegulator_Vdd1LDO) /* Only VDD1 LDO configurable from Sense side. */
    {
        ret = kStatus_InvalidArgument;
    }
#endif   /* PMC0, only compute domain support DCDC, LDO VDD2 control. */
    else /* LDO with 4 setpoints. */
    {
        if ((lvd->VDD12.lvl3 < lvd->VDD12.lvl2) || (lvd->VDD12.lvl2 < lvd->VDD12.lvl1) ||
            (lvd->VDD12.lvl1 < lvd->VDD12.lvl0) || (lvd->VDD12.lvl0 < POWER_MINI_LVD_VOLT))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC_REG(0x30U + 4U * ((uint32_t)regulator - 1U)) =
                PMC_LVDVDD1CTRL_LVL0(
                    POWER_CalRegValueFromVolt(lvd->VDD12.lvl0, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE)) |
                PMC_LVDVDD1CTRL_LVL1(
                    POWER_CalRegValueFromVolt(lvd->VDD12.lvl1, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE)) |
                PMC_LVDVDD1CTRL_LVL2(
                    POWER_CalRegValueFromVolt(lvd->VDD12.lvl2, POWER_MINI_LVD_VOLT, POWER_LVD_VOLT_SLOPE)) |
                PMC_LVDVDD1CTRL_LVL3(POWER_CalRegValueFromVolt(lvd->VDD12.lvl3, POWER_MINI_LVD_VOLT,
                                                               POWER_LVD_VOLT_SLOPE)); /* LVDVDDxCTRL */
        }
    }

    return ret;
}

void POWER_GetLvdSetpoints(power_regulator_t regulator, power_lvd_voltage_t *lvd)
{
    uint32_t reg = 0U;

    (void)memset(lvd, 0, sizeof(power_lvd_voltage_t));

    if (regulator == kRegulator_DCDC) /* DCDC with 2 setpoints. */
    {
        reg = PMC->LVDVDDNCTRL;
        lvd->lvl[0] =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDDNCTRL_LVL0_MASK) >> PMC_LVDVDDNCTRL_LVL0_SHIFT);
        lvd->lvl[1] =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDDNCTRL_LVL1_MASK) >> PMC_LVDVDDNCTRL_LVL1_SHIFT);
    }
    else /* LDO with 4 setpoints. */
    {
        reg = PMC_REG(0x30U + 4U * ((uint32_t)regulator - 1U));

        lvd->VDD12.lvl0 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL0_MASK) >> PMC_LVDVDD2CTRL_LVL0_SHIFT);
        lvd->VDD12.lvl1 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL1_MASK) >> PMC_LVDVDD2CTRL_LVL1_SHIFT);
        lvd->VDD12.lvl2 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL2_MASK) >> PMC_LVDVDD2CTRL_LVL2_SHIFT);
        lvd->VDD12.lvl3 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL3_MASK) >> PMC_LVDVDD2CTRL_LVL3_SHIFT);
    }
}

void POWER_SelectRunSetpoint(power_regulator_t regulator, uint32_t setpoint)
{
    if (regulator == kRegulator_DCDC)
    {
        assert(setpoint < 2U);
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_DCDC_VSEL_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_DCDC_VSEL(setpoint);
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        assert(setpoint < 4U);
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO2_VSEL_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO2_VSEL(setpoint);
    }
    else
    {
        assert(setpoint < 4U);
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO1_VSEL_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO1_VSEL(setpoint);
    }
}

void POWER_SelectSleepSetpoint(power_regulator_t regulator, uint32_t setpoint)
{
    if (regulator == kRegulator_DCDC)
    {
        assert(setpoint < 2U);
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_DCDC_VSEL_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_DCDC_VSEL(setpoint);
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        assert(setpoint < 4U);
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO2_VSEL_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO2_VSEL(setpoint);
    }
    else
    {
        assert(setpoint < 4U);
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO1_VSEL_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO1_VSEL(setpoint);
    }
}

void POWER_SetRunRegulatorMode(power_regulator_t regulator, uint32_t mode)
{
    assert(mode <= 3U);

    if (regulator == kRegulator_DCDC)
    {
        if (SYSCON3->SILICONREV_ID == 0xA0000UL)
        {
            PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_DCDC_MODE_MASK;
            PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_DCDC_MODE(mode << 1U); /* A0 only has Bit12 for HP/LP. */
        }
        else
        {
            PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_DCDC_MODE_MASK;
            PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_DCDC_MODE(mode);
        }
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO2_MODE_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO2_MODE(mode);
    }
    else
    {
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO1_MODE_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO1_MODE(mode);
    }
}

