Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT700/fsl_power.c
void POWER_SetSleepRegulatorMode(power_regulator_t regulator, uint32_t mode)
{
    assert(mode <= 3U);

    if (regulator == kRegulator_DCDC)
    {
        if (SYSCON3->SILICONREV_ID == 0xA0000UL)
        {
            PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_DCDC_MODE_MASK;
            PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_DCDC_MODE(mode << 1U); /* A0 only has Bit12 for HP/LP. */
        }
        else
        {
            PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_DCDC_MODE_MASK;
            PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_DCDC_MODE(mode);
        }
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO2_MODE_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO2_MODE(mode);
    }
    else
    {
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO1_MODE_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO1_MODE(mode);
    }
}

void POWER_ResetIOBank(uint32_t mask)
{
    uint32_t cfg = 0U;
    cfg          = PMC->PADCFG;

    cfg &= ~(PMC_PADCFG_ISOCTRL_MASK | PMC_PADCFG_RSTCTRL_MASK); /* Clear W1C bits. */
    PMC->PADCFG = cfg | (mask << PMC_PADCFG_RSTCTRL_SHIFT);
}

void POWER_IOBankIsolationHold(uint32_t mask)
{
    uint32_t cfg = 0U;
    cfg          = PMC->PADCFG;

    cfg &= ~(PMC_PADCFG_ISOCTRL_MASK | PMC_PADCFG_RSTCTRL_MASK); /* Clear W1C bits. */

    PMC->PADCFG = cfg | (mask << PMC_PADCFG_ISOHOLD_SHIFT);
}

void POWER_IOBankClearIsolationHold(uint32_t mask)
{
    PMC->PADCFG |= mask << PMC_PADCFG_ISOCTRL_SHIFT; /* W1C. */
}

#if defined(PMC0)
void POWER_ConfigRBBVolt(const power_rbb_voltage_t *config)
{
    PMC->BBCTRL = (*((const uint32_t *)(const void *)config)) &
                  (PMC_BBCTRL_RBB1LVL_MASK | PMC_BBCTRL_RBB2LVL_MASK | PMC_BBCTRL_RBBNLVL_MASK);
}

void POWER_SetVddnSupplySrc(power_vdd_src_t src)
{
#if defined(FSL_FEATURE_SILICON_VERSION_A) && (FSL_FEATURE_SILICON_VERSION_A != 0U)
    assert(src == kVddSrc_PMIC); /* The VDDN can't be supplied by DCDC due to ERRATA052405. */
#endif
    s_vddnSrc = src;
    if (s_vddnSrc == kVddSrc_PMIC) /* If powered by external PMIC, power down DCDC. */
    {
        PMC->POWERCFG |= PMC_POWERCFG_DCDCPD_MASK;
    }
}

void POWER_SetVdd1SupplySrc(power_vdd_src_t src)
{
    s_vdd1Src = src;
    if (src == kVddSrc_PMIC) /* If powered by external PMIC, power down LDO1. */
    {
        PMC->POWERCFG |= PMC_POWERCFG_LDO1PD_MASK;
    }
}

void POWER_SetVdd2SupplySrc(power_vdd_src_t src)
{
    s_vdd2Src = src;
    if (src == kVddSrc_PMIC) /* If powered by external PMIC, power down LDO2. */
    {
        PMC->POWERCFG |= PMC_POWERCFG_LDO2PD_MASK;
    }
}

void POWER_DisableRegulators(uint32_t mask)
{
    PMC->POWERCFG |= mask & 0xFF80U; /* Ignore FDSR related bits. */
}

void POWER_EnableSleepRegulators(uint32_t mask)
{
    PMC->POWERCFG &= ~(mask & 0x7FU); /* Ignore all mode control bits. */
}

void POWER_DisableSleepRegulators(uint32_t mask)
{
    PMC->POWERCFG |= mask & 0x7FU; /* Ignore all mode control bits. */
}

void POWER_SetPMICModeDelay(uint8_t value)
{
    PMC->POWERCFG &= ~PMC_POWERCFG_MODEDLY_MASK;
    PMC->POWERCFG |= PMC_POWERCFG_MODEDLY(value);
}

void POWER_SetPORVoltage(const power_por_voltage_t *porVolt)
{
    PMC->PORCTRL = (*((const uint32_t *)(const void *)porVolt));
}
#endif

#if defined(PMC0) /* Compute domain request enter deep sleep mode. */
AT_QUICKACCESS_SECTION_CODE(static void POWER_EnableXspiCache(CACHE64_CTRL_Type *cache))
{
    /* First, invalidate the entire cache. */
    cache->CCR |= CACHE64_CTRL_CCR_INVW0_MASK | CACHE64_CTRL_CCR_INVW1_MASK | CACHE64_CTRL_CCR_GO_MASK;
    while ((cache->CCR & CACHE64_CTRL_CCR_GO_MASK) != 0x00U)
    {
    }
    /* As a precaution clear the bits to avoid inadvertently re-running this command. */
    cache->CCR &= ~(CACHE64_CTRL_CCR_INVW0_MASK | CACHE64_CTRL_CCR_INVW1_MASK);
    /* Now enable the cache. */
    cache->CCR |= CACHE64_CTRL_CCR_ENCACHE_MASK;
}

AT_QUICKACCESS_SECTION_CODE(static void POWER_DisableXspiCache(CACHE64_CTRL_Type *cache))
{
    /* First, clean XSPI cache. */
    cache->CCR |= CACHE64_CTRL_CCR_PUSHW0_MASK | CACHE64_CTRL_CCR_PUSHW1_MASK | CACHE64_CTRL_CCR_GO_MASK;
    while ((cache->CCR & CACHE64_CTRL_CCR_GO_MASK) != 0x00U)
    {
    }
    /* As a precaution clear the bits to avoid inadvertently re-running this command. */
    cache->CCR &= ~(CACHE64_CTRL_CCR_PUSHW0_MASK | CACHE64_CTRL_CCR_PUSHW1_MASK);

    /* Now disable XSPI cache. */
    cache->CCR &= ~CACHE64_CTRL_CCR_ENCACHE_MASK;
}

AT_QUICKACCESS_SECTION_CODE(static void deinitXSPI(XSPI_Type *base, CACHE64_CTRL_Type *cache))
{
    xspiCacheEnabled = false;
    base->MCR &= ~XSPI_MCR_MDIS_MASK;

    /* Wait until XSPI is not busy */
    while ((base->SR & XSPI_SR_BUSY_MASK) != 0U)
    {
    }

    if ((cache->CCR & CACHE64_CTRL_CCR_ENCACHE_MASK) != 0x00U)
    {
        xspiCacheEnabled = true;
        POWER_DisableXspiCache(cache);
    }

    /* Disable module. */
    base->MCR |= XSPI_MCR_MDIS_MASK;
}

AT_QUICKACCESS_SECTION_CODE(static void initXSPI(XSPI_Type *base, CACHE64_CTRL_Type *cache))
{
    /* Disable XSPI module */
    base->MCR |= XSPI_MCR_MDIS_MASK;
    base->MCR |= XSPI_MCR_IPS_TG_RST_MASK;

    base->MCR &= ~XSPI_MCR_MDIS_MASK;

    base->MCR |= XSPI_MCR_SWRSTSD_MASK | XSPI_MCR_SWRSTHD_MASK;
    for (uint32_t i = 0U; i < 6U; i++)
    {
        __NOP();
    }
    base->MCR |= XSPI_MCR_MDIS_MASK;
    base->MCR &= ~(XSPI_MCR_SWRSTSD_MASK | XSPI_MCR_SWRSTHD_MASK);
    for (uint32_t i = 0U; i < 6U; i++)
    {
        __NOP();
    }
    base->MCR &= ~XSPI_MCR_MDIS_MASK;

    base->MCR |= XSPI_MCR_MDIS_MASK;

    /* Clear AHB buffer. */
    base->SPTRCLR |= XSPI_SPTRCLR_ABRT_CLR_MASK;
    while ((base->SPTRCLR & XSPI_SPTRCLR_ABRT_CLR_MASK) != 0UL)
    {
    }

    /* Clear AHB access sequence pointer. */
    base->SPTRCLR |= XSPI_SPTRCLR_BFPTRC_MASK;

    /* Enable XSPI module */
    base->MCR &= ~XSPI_MCR_MDIS_MASK;

    if (xspiCacheEnabled)
    {
        POWER_EnableXspiCache(cache);
    }

    __DSB();
    __ISB();
}

AT_QUICKACCESS_SECTION_CODE(static void deinitXip(void))
{
    if (POWER_IS_XIP_XSPI0())
    {
        /* Enable XSPI clock again */
        CLKCTL0->PSCCTL1_SET = CLKCTL0_PSCCTL1_SET_XSPI0_MASK;
        /* Disable XSPI module */
        deinitXSPI(XSPI0, CACHE64_CTRL0);
        CLKCTL0->PSCCTL1_CLR = CLKCTL0_PSCCTL1_SET_XSPI0_MASK;
    }
    else if (POWER_IS_XIP_XSPI1())
    {
        /* Enable XSPI clock again */
        CLKCTL0->PSCCTL1_SET = CLKCTL0_PSCCTL1_SET_XSPI1_MASK;
        /* Disable XSPI module */
        deinitXSPI(XSPI1, CACHE64_CTRL1);
        CLKCTL0->PSCCTL1_CLR = CLKCTL0_PSCCTL1_SET_XSPI1_MASK;
    }
    else
    {
        /* Do nothing */
    }
}

AT_QUICKACCESS_SECTION_CODE(static void initXip(void))
{
    if (POWER_IS_XIP_XSPI0())
    {
        /* Enable XSPI clock again */
        CLKCTL0->PSCCTL1_SET = CLKCTL0_PSCCTL1_SET_XSPI0_MASK;
        /* Re-enable XSPI module */
        initXSPI(XSPI0, CACHE64_CTRL0);
    }
    else if (POWER_IS_XIP_XSPI1())
    {
        /* Enable XSPI clock again */
        CLKCTL0->PSCCTL1_SET = CLKCTL0_PSCCTL1_SET_XSPI1_MASK;
        /* Re-enable XSPI module */
        initXSPI(XSPI1, CACHE64_CTRL1);
    }
    else
    {
        /* Do nothing */
    }
}

/* Need do low power request-ack for all the modules capable of DMA HW Wake function if the DMA_HWWake is used. */
AT_QUICKACCESS_SECTION_CODE(static void POWER_DMA_HWWake_LPRequest(void))
{
    uint32_t lpReqClockCfg, lpReqResetCfg;

    if (SLEEPCON0->HW_WAKE != 0U) /* Only assert the LP Requet when DMA HW_WAKE enabled. */
    {
        lpReqClockCfg  = CLKCTL0->PSCCTL1;
        lpReqResetCfg  = RSTCTL0->PRSTCTL2;
        lpReqConfig[0] = SLEEPCON0->PRIVATE_CCTRL0;
        lpReqConfig[1] = SLEEPCON0->SHA_MED_TCTRL0;
        lpReqConfig[2] = SLEEPCON0->SHA_SEN_TCTRL0;
        lpReqConfig[3] = SLEEPCON0->PRIVATE_TCTRL0;
        lpReqConfig[4] = SLEEPCON0->PRIVATE_TCTRL2;

        CLKCTL0->PSCCTL1_SET =
            CLKCTL0_PSCCTL1_EDMA0_MASK |
            CLKCTL0_PSCCTL1_EDMA1_MASK; /* DMA clock need to be enabled to finishe low power handshake. */
        RSTCTL0->PRSTCTL2_CLR =
            RSTCTL0_PRSTCTL2_EDMA0_MASK |
            RSTCTL0_PRSTCTL2_EDMA1_MASK; /* DMA reset need to be cleared to finishe low power handshake. */

